# Aula 2 - Machine Learning and Data Science - UDEMY
   
    
    # REVISÃO aula 1

In [4]:
import pandas as pd
import numpy as np
# visualizacao de graficos
import seaborn as sns 
import matplotlib.pyplot as plt
import plotly.express as px

In [5]:
df=pd.read_csv(r"D:\Arquivos python\MACHINE LEARNING\Bases de dados\credit_data.csv")
display(df)

      clientid        income        age         loan  default
0            1  66155.925095  59.017015  8106.532131        0
1            2  34415.153966  48.117153  6564.745018        0
2            3  57317.170063  63.108049  8020.953296        0
3            4  42709.534201  45.751972  6103.642260        0
4            5  66952.688845  18.584336  8770.099235        1
...        ...           ...        ...          ...      ...
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

[2000 rows x 5 columns]

In [6]:
# localizar idades negativas
df.loc[df['age'] <0]

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

In [7]:
# excluir registros negativos com essa média
df['age'][df['age']>0].mean()

40.92770044906149

In [8]:
df.loc[df['age']<0,  "age"  ]=40.92770044906149

In [9]:
df[df['age']<0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [10]:
   # TRATAMENTO DOS VALORES FALTANTES

In [11]:
df.isnull().sum()

clientid    0
income      0
age         3
loan        0
default     0
dtype: int64

In [12]:
df.loc[ pd .isnull(df['age'])]

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

In [13]:
#fill= preencher, na= valores nulos. fillna
# colocar inplace para alterar
df['age'].fillna(df['age'].mean(), inplace=True)

In [14]:
df.loc[ pd .isnull(df['age'])]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [15]:
#  isin = está dentro
df.loc[df['clientid'].isin([29, 31, 32])]

    clientid        income      age         loan  default
28        29  59417.805406  40.9277  2082.625938        0
30        31  48528.852796  40.9277  6155.784670        0
31        32  23526.302555  40.9277  2862.010139        0

In [16]:
#  Divisao de Previsor (x) e Classe (y)

In [17]:
# iloc seleciona linhas de colunas
# : indica todas as linhas e as colunas menos o indice 
# 1:4 neste caso o 4 não conta no python, é da coluna 1(income) até a terceira coluna (loan)
# values para CONVERTER para o numpy
x_df=df.iloc[:, 1:4].values
x_df

array([[6.61559251e+04, 5.90170151e+01, 8.10653213e+03],
       [3.44151540e+04, 4.81171531e+01, 6.56474502e+03],
       [5.73171701e+04, 6.31080495e+01, 8.02095330e+03],
       ...,
       [4.43114493e+04, 2.80171669e+01, 5.52278669e+03],
       [4.37560566e+04, 6.39717958e+01, 1.62272260e+03],
       [6.94365796e+04, 5.61526170e+01, 7.37883360e+03]])

In [18]:
type(x_df)

numpy.ndarray

In [19]:
# buscar a coluna default
y_df=df.iloc[:, 4].values
y_df

array([0, 0, 0, ..., 1, 0, 0], dtype=int64)

In [20]:
type(y_df)

numpy.ndarray

In [21]:
# menor renda, idade e divida
x_df[:, 0].min(), x_df[:, 1].min(), x_df[:, 2].min()

(20014.4894700497, 18.055188510566897, 1.37762959325451)

In [34]:
# APRENDIZAGEM DE MÁQUINA

# Padronização e Normalização

In [40]:
# Padronização para que a máquina entenda que todos valores estão na mesma escala de importância
from sklearn.preprocessing import StandardScaler
escala = StandardScaler()
x_df=escala.fit_transform(x_df)

In [45]:
#   x_df=StandardScaler().fit_transform(x_df)

In [46]:
# Menor renda, idade e divida PRADRONIZADOS

x_df[:, 0].min(), x_df[:, 1].min(), x_df[:, 2].min()

(-1.7676158019964077, -1.7264154144794286, -1.459279109946241)

In [47]:
# Maior renda, idade e divida PRADRONIZADOS

x_df[:, 0].max(), x_df[:, 1].max(), x_df[:, 2].max()

(1.7220222385319197, 1.739366520151568, 3.0616609141708273)